Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: Stair landings and other floor areas within interior exit stairways, interior exit ramps and exit passageways, with the exception of the sides of steps, shall be provided with solid and continuous demarcation lines on the floor or on the walls or a combination of both.
fr_ca: Les paliers d’escalier et les autres surfaces de plancher à l’intérieur des escaliers et rampes d’issue intérieurs et des passages d’issue, à l’exception des côtés des marches, doivent être munis de lignes de démarcation pleines et continues sur le plancher ou sur les murs, ou une combinaison des deux.

source: Stair level identification signs in raised characters and braille complying with Sections 703.3 and 703.4 shall be located at each floor level landing in all enclosed stairways adjacent to the door leading from the stairwell into the corridor to identify the floor level.
fr_ca: Des panneaux d'identification du niveau de l'escalier en caractères en relief et en braille conformes aux articles 703.3 et 703.4 doivent être situés à chaque palier au niveau du sol dans tous les escaliers encloisonnés adjacents à la porte menant de la cage d'escalier au corridor pour identifier le niveau du sol.

source: Stair treads and landings subject to wet conditions shall be designed to prevent the accumulation of water.
fr_ca: Les marches et les paliers d'escaliers soumis à des conditions humides doivent être conçus pour empêcher l'accumulation d'eau.

source: Stair treads and risers shall meet the requirements of this section.
fr_ca: Les marches et les contremarches d'escaliers doivent satisfaire aux exigences de la présente section.

source: Stair treads shall comply with Section 302 and shall have a slope not steeper than 1:48.
fr_ca: Les marches d'escalier doivent être conformes à la section 302 et présenter une pente maximale de 1:48.

source: Stairs shall have handrails complying with Section 505.
fr_ca: Les escaliers doivent avoir des rampes conformes à la section 505.

source: Stairway doors other than the exit discharge doors shall be permitted to be locked from the stairway side.
fr_ca: Les portes de cage d’escalier autres que les portes d’issue d’évacuation peuvent être verrouillées du côté de la cage d’escalier.

source: Stairway doors that are locked from the stairway side shall be capable of being unlocked simultaneously without unlatching upon a signal from the fire command center.
fr_ca: Les portes de cage d’escalier qui sont verrouillées du côté de la cage d’escalier doivent pouvoir être déverrouillées simultanément sans être déverrouillées du pêne sur réception d’un signal provenant du centre de commandement en cas d’incendie.

source: Stairway identification signs shall comply with all of the following requirements:
fr_ca: Les panneaux d'identification des escaliers doivent être conformes à toutes les exigences suivantes :

source: Stairways shall be not less than 36 inches (914 mm) in clear width at all points above the permitted handrail height and below the required headroom height.
fr_ca: Les escaliers doivent avoir une largeur libre d'au moins 36 po [914 mm] en tout point au-dessus de la hauteur autorisée des rampes et en dessous de la hauteur libre requise.

source: Stairways shall have a clear width of 48 inches (1219 mm) minimum between handrails.
fr_ca: Les escaliers doivent avoir une largeur libre d'au moins 48 po [1219 mm] entre les mains courantes.

source: Stairways.
fr_ca: Escaliers.

source: Standard roll-in-type shower compartments shall comply with Section 608.2.2.
fr_ca: Les cabines de douche de type fauteuil roulant standard doivent être conformes à la section 608.2.2.

source: Standby or emergency power shall be provided or the gas detection system shall initiate a trouble signal at an approved location if the power supply is interrupted.
fr_ca: Une alimentation de secours ou d’urgence doit être prévue ou le système de détection de gaz doit déclencher un signal de dérangement à un endroit approuvé en cas d’interruption de l’alimentation électrique.

source: Standpipe systems shall be provided in accordance with Section 905.
fr_ca: Les systèmes de canalisations d’incendie doivent être prévus conformément à la section 905.

source: Standpipes and standpipe hose connections shall be provided where required by Sections 905.3 and 905.4.
fr_ca: Des colonnes d'incendie et des raccords de tuyaux pour colonnes d'incendie doivent être prévus lorsque les sections 905.3 et 905.4 l'exigent.

source: State the valuation of the proposed work.
fr_ca: Indiquer la valeur des travaux proposés.

source: Steam, hot or chilled water piping within any heating or cooling equipment regulated by this code.
fr_ca: Tuyauterie de vapeur, d'eau chaude ou d'eau glacée dans tout équipement de chauffage ou de refroidissement réglementé par le présent code.

source: Steel fireplace units incorporating a steel firebox lining shall be constructed with steel not less than 1/4 inch (6.4 mm) thick, and an air-circulating chamber that is ducted to the interior of the building.
fr_ca: Les foyers en acier comportant un revêtement de chambre de combustion en acier doivent être construits en acier d'une épaisseur d'au moins 1/4 po (6,4 mm) et comporter une chambre de circulation d'air reliée par un conduit à l'intérieur du bâtiment.

source: Steeper than 1:10 but not steeper than 1:8
fr_ca: Plus raide que 1:10, mais pas plus raide que 1:8

source: Steeper than 1:12 but not steeper than 1:10
fr_ca: Plus raide que 1:12 mais pas plus raide que 1:10

source: Stepped aisle treads where the stepped aisle changes direction at a vomitory shall have a depth of not less than 11 inches (280 mm) or the stepped aisle tread depth, whichever is greater.
fr_ca: Les marches des allées à gradins, lorsque l’allée à gradins change de direction au niveau d’un vomitoire, doivent avoir une profondeur d’au moins 11 po (280 mm) ou égale à la profondeur des marches de l’allée à gradins, selon la plus grande de ces valeurs.

source: Stepped aisles shall comply with Sections 1030.14.2 through 1030.14.2.4.
fr_ca: Les allées à gradins doivent être conformes aux sections 1030.14.2 à 1030.14.2.4.

source: Stepped aisles that change direction at vomitories shall comply with Section 1030.11.1 Transitions between a stepped aisle above a vomitory and a stepped aisle to the side of a vomitory shall comply with Section 1030.11.2.
fr_ca: Les allées à gradins qui changent de direction au niveau des vomitoires doivent être conformes à la section 1030.11.1. Les transitions entre une allée à gradins située au-dessus d’un vomitoire et une allée à gradins située à côté d’un vomitoire doivent être conformes à la section 1030.11.2.

source: Stepped aisles with handrails within 30 inches
fr_ca: Allées en escalier avec mains courantes à moins de 30 po

source: Stepped aisles without handrails within 30 inches
fr_ca: Allées en escalier sans mains courantes à moins de 30 po

source: Stepped aisles, transitions and stairways that maintain the stepped aisle riser and tread dimensions shall comply with Section 1030.14 as one exit access component.
fr_ca: Les allées en gradins, les transitions et les escaliers qui conservent les dimensions de la contremarche et de la marche de l'allée à gradins doivent être conformes à la section 1030.14 en tant qu'élément d'accès à l'issue.

source: Steps shall have an inside width of not less than 12 inches (305 mm), shall have treads greater than 5 inches (127 mm) in depth and a riser height not greater than 18 inches (457 mm) for the full height of the area well.
fr_ca: Les marches doivent avoir une largeur intérieure d’au moins 12 po (305 mm), des girons d’une profondeur supérieure à 5 po (127 mm) et des contremarches d’une hauteur d’au plus 18 po (457 mm), sur toute la hauteur du puits de fenêtre.

source: Stories and mezzanines exempted by Section 1104.4.
fr_ca: Étages et mezzanines exemptés par la section 1104.4.

source: Stories and mezzanines exempted by Section 1108.4.
fr_ca: Étages et mezzanines exemptés par la section 1108.4.

source: Stories or mezzanines containing offices of health care providers (Group B or I).
fr_ca: Étages ou mezzanines contenant des bureaux de prestataires de soins de santé (groupe B ou I).

source: Stories, mezzanines or occupied roofs that do not contain accessible elements or other spaces as determined by Section 1108 or 1109 are not required to be served by an accessible route from an accessible level.
fr_ca: Les étages, les mezzanines ou les toits occupés qui ne contiennent pas d'éléments accessibles ou d'autres espaces tels que déterminés par la section 1108 ou 1109 ne sont pas tenus d'être desservis par un itinéraire accessible à partir d'un niveau accessible.

source: Storm and screen doors shall be permitted to swing over exterior stairs and landings.
fr_ca: Les contre-portes et les portes moustiquaires doivent pouvoir s'ouvrir au-dessus des escaliers et des paliers extérieurs.

source: Storm and screen doors shall not be required to comply with Section 404.2.5.
fr_ca: Les contre-portes et les portes moustiquaires ne sont pas tenues de se conformer à la section 404.2.5.

source: Strap
fr_ca: Sangle

source: Straps shall be hooked around the outer bars and extend 6 inches (152 mm) beyond the bend.
fr_ca: Les sangles doivent être accrochées autour des barres extérieures et se prolonger de 6 po [152 mm] au-delà du coude.

source: Structures with four or more dwelling units.
fr_ca: Structures de quatre logements ou plus.

source: Structures, sites and equipment directly associated with the actual processes of construction including, but not limited to, scaffolding, bridging, materials hoists, materials storage or construction trailers are not required to comply with this chapter.
fr_ca: Les structures, les sites et les équipements directement associés aux activités réelles de construction, notamment, sans toutefois s’y limiter, les échafaudages, les passerelles, les monte-matériaux, les aires d’entreposage des matériaux ou les roulottes de chantier, ne sont pas tenus d’être conformes au présent chapitre.

source: Submittal documents consisting of construction documents, statement of special inspections, geotechnical report and other data shall be submitted in two or more sets, or in a digital format where allowed by the building official, with each permit application.
fr_ca: Les documents à soumettre, notamment les documents de construction, l’énoncé des inspections spéciales, le rapport géotechnique et les autres données, doivent être soumis en deux exemplaires ou plus, ou dans un format numérique lorsque le responsable de la construction l’autorise, avec chaque demande de permis.

source: Such application shall:
fr_ca: Cette demande doit :

source: Such doors shall have a vision panel with fire-protection-rated glazing materials in fire-protection-rated frames, the area of which shall not exceed that tested.
fr_ca: Ces portes doivent avoir un regard vitré constitué de matériaux de vitrage présentant un degré de protection contre l’incendie, installés dans des cadres présentant un degré de protection contre l’incendie, dont la superficie ne doit pas dépasser celle testée.

source: Such foyer, if not directly connected to a public street by all the main entrances or exits, shall have a straight and unobstructed corridor or path of travel to every such main entrance or exit.
fr_ca: Un tel foyer, s’il n’est pas directement relié à une rue publique par toutes les entrées ou issues principales, doit être desservi par un corridor ou un parcours rectiligne et sans obstruction menant à chacune de ces entrées ou issues principales.

source: Such interconnected stories shall not be open to other stories.
fr_ca: Ces étages interconnectés ne doivent pas être ouverts sur d’autres étages.

source: Such lighting outlet shall be controlled by a wall switch or shall have an integral switch.
fr_ca: Cette prise d'éclairage doit être commandée par un interrupteur mural ou être munie d'un interrupteur intégré.

source: Such liners shall turn up on all sides not less than 2 inches (51 mm) above the finished threshold level.
fr_ca: Ces revêtements doivent remonter de tous les côtés à au moins 2 po [51 mm] au-dessus du niveau du seuil fini.

source: Such maneuvering clearances shall be measured where the adult changing surface is in the operational position.
fr_ca: Ces espaces de dégagement doivent être mesurés lorsque la surface à langer pour adultes est en position opérationnelle.

source: Such materials shall include, but not be limited to, self-luminous materials and photoluminescent materials.
fr_ca: Ces matériaux doivent comprendre, sans s'y limiter, les matériaux auto-luminescents et les matériaux photoluminescents.

source: Such openings shall be provided with ready access or shall otherwise be readily controllable by the building occupants.
fr_ca: Ces ouvertures doivent être facilement accessibles ou autrement facilement contrôlables par les occupants du bâtiment.

source: Such openings shall open directly into a public way or to a yard or court that opens to a public way.
fr_ca: Ces ouvertures doivent s'ouvrir directement sur une voie publique ou sur une cour ou un jardin qui s'ouvre sur une voie publique.

source: Such penetrations shall be protected in accordance with Section 714.
fr_ca: De telles pénétrations doivent être protégées selon la section 714.

source: Such penetrations shall be protected in accordance with Section 714.4.2.
fr_ca: De telles pénétrations doivent être protégées selon la section 714.4.2.

source: Such receptacle outlets shall not be connected to the heater circuits.
fr_ca: Ces prises de courant ne doivent pas être connectées aux circuits de chauffage.

source: Such sprinklers shall be installed at alternate floors, beginning with the second level below the last intake and ending with the floor above the discharge.
fr_ca: Ces extincteurs automatiques doivent être installés à chaque étage sur deux, en commençant par le deuxième niveau sous la dernière prise et en terminant par l’étage situé au-dessus du niveau d’évacuation.

source: Such stories shall be divided into smoke compartments with an area of not more than 22,500 square feet (2092 m2) and the distance of travel from any point in a smoke compartment to a smoke barrier door shall not exceed 200 feet (60 960 mm).
fr_ca: Ces étages doivent être subdivisés en compartiments coupe-fumée d’une superficie d’au plus 22 500 pieds carrés (2 092 m²), et la distance de parcours entre tout point d’un compartiment coupe-fumée et une porte de séparation pare-fumée ne doit pas être supérieure à 200 pi [60 960 mm].

source: Such stripe shall be not less than 1 inch (25 mm) and not more than 2 inches (51 mm) wide.
fr_ca: Cette bande doit avoir une largeur d’au moins 1 po (25 mm) et d’au plus 2 po (51 mm).

source: Such stripe shall be not less than 1 inch (25 mm), and not more than 2 inches (51 mm), wide.
fr_ca: Cette bande doit avoir une largeur d'au moins 1 po (25 mm) et d'au plus 2 po (51 mm).

source: Such ventilation shall comply with Section 410.2.7.1 or 410.2.7.2.
fr_ca: Cette ventilation doit être conforme à la section 410.2.7.1 ou 410.2.7.2.

source: Such wall surfaces shall extend to a height of not less than 6 feet (1829 mm) above the floor.
fr_ca: Ces surfaces murales doivent se prolonger jusqu'à une hauteur d'au moins 6 pi [1829 mm] au-dessus du sol.

source: Such walls shall form a watertight joint with each other and with either the tub or shower floor.
fr_ca: Ces murs doivent former un joint étanche entre eux et avec le plancher de la baignoire ou de la douche.

source: Suction fittings for whirlpool bathtubs shall comply with ASME A112.19.7/CSA B45.10.
fr_ca: Les raccords d'aspiration pour les baignoires à remous doivent être conformes à la norme ASME A112.19.7/CSA B45.10.

source: Supplemental means shall be provided for manual operation of the ventilator.
fr_ca: Des moyens supplémentaires doivent être prévus pour le fonctionnement manuel du ventilateur.

source: Suspended acoustical ceiling systems shall be installed in accordance with the provisions of ASTM C635 and ASTM C636.
fr_ca: Les systèmes de plafonds acoustiques suspendus doivent être installés conformément aux dispositions des normes ASTM C635 et ASTM C636.

source: Swinging doors shall be power-operated and shall comply with ANSI/BHMA A156.19 listed in Section 106.2.6.
fr_ca: Les portes battantes doivent être à commande électrique et être conformes à la norme ANSI/BHMA A156.19 mentionnée à la section 106.2.6.

source: Swinging hoistway doors shall open and close automatically and shall comply with Sections 408.3.2, 404, and 407.3.2.
fr_ca: Les portes battantes de la cage d'ascenseur doivent s'ouvrir et se fermer automatiquement et doivent être conformes aux sections 408.3.2, 404 et 407.3.2.

source: Swings and other playground equipment accessory to detached one- and two-family dwellings.
fr_ca: Balançoires et autres équipements de terrain de jeu accessoires aux habitations individuelles et aux habitations bifamiliales détachées.

source: Symbols of accessibility shall contrast with their backgrounds, with either a light symbol on a dark background or a dark symbol on a light background.
fr_ca: Les symboles d'accessibilité doivent contraster avec leur arrière-plan, soit avec un symbole clair sur un fond foncé, soit avec un symbole foncé sur un fond clair.

source: System supervision with manual start and transfer features shall be provided at the fire command center.
fr_ca: Un système de supervision avec des fonctions de démarrage manuel et de transfert doit être installé au centre de commandement en cas d’incendie.

source: Systems and components shall be listed and approved for the purpose for which they are installed.
fr_ca: Les systèmes et les éléments doivent être répertoriés et approuvés aux fins pour lesquelles ils sont installés.

source: TABLE 2406.2(1)
fr_ca: TABLEAU 2406.2(1)

source: TABLE 2406.2(2)
fr_ca: TABLEAU 2406.2(2)

source: TABLE R308.3.1(2)
fr_ca: TABLEAU R308.3.1(2)

source: TOTAL NUMBER OF SEATS IN THE SMOKE-PROTECTED ASSEMBLY SEATING
fr_ca: NOMBRE TOTAL DE SIÈGES DANS LA RÉUNION AVEC PROTECTION CONTRE LA FUMÉE

source: Tactile signs shall contain both raised characters and braille.
fr_ca: Les enseignes tactiles doivent contenir à la fois des caractères en relief et du braille.

source: Team and player seating shall comply with Sections 802.2 through 802.7.
fr_ca: Les sièges des équipes et des joueurs doivent être conformes aux sections 802.2 à 802.7.

source: Technical production areas shall be provided with means of egress and means of escape in accordance with Sections 410.5.3.1 through 410.5.3.5.
fr_ca: Les zones de production technique doivent être dotées de moyens d'évacuation et de moyens d'évacuation d'urgence conformément aux articles 410.5.3.1 à 410.5.3.5.

source: Telephones with volume controls shall be identified by a pictogram of a telephone handset with radiating sound waves on a square field complying with Figure 703.6.3.4.
fr_ca: Les téléphones avec commandes de volume doivent être identifiés par un pictogramme d'un combiné téléphonique avec des ondes sonores rayonnantes sur un champ carré conforme à la figure 703.6.3.4.

source: Tempered spandrel glass shall be provided with a removable paper marking by the manufacturer.
fr_ca: Le verre trempé pour tympan doit être muni d’un marquage sur papier amovible apposé par le fabricant.

source: Temporary motion picture, television and theater stage sets and scenery.
fr_ca: Décors et éléments scéniques temporaires pour le cinéma, la télévision et le théâtre.

source: Temporary testing systems: A permit shall not be required for the installation of any temporary system required for the testing or servicing of electrical equipment or apparatus.
fr_ca: Systèmes d’essai temporaires : Aucun permis n’est exigé pour l’installation d’un système temporaire requis pour l’essai ou l’entretien d’équipements ou d’appareils électriques.

source: Test reports confirming the information provided in the manufacturer's product identification shall be furnished to the building official on request.
fr_ca: Les rapports d'essai confirmant les informations se trouvant dans l'identification du produit du fabricant doivent être fournis sur demande au responsable de la construction.

source: That area of a building adjacent to or above the atrium need not be sprinklered provided that portion of the building is separated from the atrium portion by not less than 2-hour fire barriers constructed in accordance with Section 707 or horizontal assemblies constructed in accordance with Section 711, or both.
fr_ca: La zone d’un bâtiment adjacente à l’atrium ou située au-dessus de celui-ci n’a pas besoin d’être équipée de gicleurs à condition que cette partie du bâtiment soit séparée de la partie du bâtiment constituant l’atrium par des barrières coupe-feu d’au moins 2 heures construites conformément à l’article 707 ou par des ensembles horizontaux construits conformément à l’article 711, ou par les deux.

source: That portion of the total permitted exit access travel distance from each seat to the nearest entrance to a vomitory or concourse shall not exceed 200 feet (60 960 mm).
fr_ca: La portion de la distance de parcours totale autorisée entre chaque siège et l'entrée la plus proche d'un vestibule ou d'un hall ne doit pas dépasser 200 pi [60 960 mm].

source: The 10-percent limit shall not apply to curtains, draperies, fabric hangings and similar combustible decorative materials used as window coverings.
fr_ca: La limite de 10 % ne s’applique pas aux rideaux, tentures, éléments suspendus en tissu et matériaux décoratifs combustibles similaires utilisés comme couvre-fenêtres.

source: The 12-inch (305 mm) dimension shall be measured from the widest point of the clear stair width at the walking surface.
fr_ca: La dimension de 12 po (305 mm) doit être mesurée à partir du point le plus large de la largeur libre de l'escalier à la surface de marche.

source: The 19-inch (483 mm) distance shall be measured perpendicular to the side of the table or counter.
fr_ca: La distance de 19 po (483 mm) doit être mesurée perpendiculairement au côté de la table ou du comptoir.

source: The 30-inch (762 mm) minimum clear width shall be maintained to provide a path to an adjacent aisle or aisle accessway.
fr_ca: La largeur libre minimale de 30 po (762 mm) doit être maintenue pour fournir un chemin vers une allée adjacente ou une voie d'accès à une allée.

source: The Group B occupant load is more than 100 persons above or below the lowest level of exit discharge.
fr_ca: La charge d'occupants du groupe B est supérieure à 100 personnes au-dessus ou au-dessous du niveau le plus bas de l'issue d'évacuation.

source: The Group F occupancy has a combined occupant load of 500 or more above or below the lowest level of exit discharge.
fr_ca: L'usage du groupe F a une charge d'occupants combinée de 500 ou plus au-dessus ou au-dessous du niveau le plus bas de l'issue d'évacuation.

source: The Group F occupancy is two or more stories in height.
fr_ca: L'occupation du groupe F a une hauteur de deux étages ou plus.

source: The International Symbol for Accessibility, complying with Section 703.6.3.1, shall be 5/8 inch (16 mm) in height and be a visual character complying with Section 703.2.
fr_ca: Le Symbole international d'accessibilité, conforme à la section 703.6.3.1, doit avoir une hauteur de 5/8 po (16 mm) et être un caractère visuel conforme à la section 703.2.

source: The International Symbol of Accessibility shall comply with Figure 703.6.3.1.
fr_ca: Le Symbole international d'accessibilité doit être conforme à la figure 703.6.3.1.
